Revit 2027 API
Transaction.GetName Method
 Returns the transaction's name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetName()
Public Function GetName As String
public:
String^ GetName()
member GetName : unit -> string
Return Value
String
 The transaction's current name.
See Also
Reference
Transaction Class
Autodesk.Revit.DB Namespace